# NotSupportConcentricBend Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..ElectricalFailures..::..NotSupportConcentricBend Property
BuiltInFailures..::..ElectricalFailures Class See Also
---
Conduit with Fittings do not support Concentric Bend Radius, the bend radius of the conduit fittings will be same.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId NotSupportConcentricBend { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property NotSupportConcentricBend As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ NotSupportConcentricBend {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..ElectricalFailures Class
Autodesk.Revit.DB Namespace